Revit 2027 API
View3D.IsPerspective Property
 Identifies whether this is a perspective view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPerspective { get; }
Public ReadOnly Property IsPerspective As Boolean
	Get
public:
property bool IsPerspective {
	bool get ();
}
member IsPerspective : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Returns true if the view is not a view template.
Remarks
 In a perspective view, view direction is variable - it is the direction that connects a particular point on the model with the eye position. The property ViewDirection becomes less meaningful - it only describes the general orientation of the camera.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace